{"id":78,"count":29,"description":"<h1>Unveiling the Flight of Meaning Etched in Ink<\/h1>\r\n<strong>Introduction: Where Feathers Take Flight on Skin<\/strong>\r\n\r\nThey dance on the wind, whisper secrets of freedom, and adorn our bodies with tales of resilience and transformation. Feather tattoos transcend mere ink; they are tapestries woven with personal stories, cultural echoes, and the enduring allure of flight.\r\n\r\nThis comprehensive guide invites you to embark on an inky odyssey into the captivating world of feather tattoos, where we’ll explore their rich symbolism, delve into diverse design possibilities, and discover the transformative journeys they represent on our skin.\r\n<h3>Unfurling the Tapestry of Meaning: What Does a Feather Tattoo Symbolize?<\/h3>\r\nFeathers, delicate yet powerful, carry a multitude of meanings that resonate across cultures and belief systems. Choosing the right feather design is not just about aesthetics; it’s about selecting a symbol that speaks to your inner landscape and resonates with your personal story. Here are some of the most potent meanings feathers can embody:\r\n\r\n<strong>Freedom:<\/strong> Feathers, synonymous with flight, are potent symbols of liberation, soaring above limitations and societal constraints. A hawk feather, its sharp quills reaching skyward, adorning your shoulder can be a constant reminder to chase your dreams and embrace the limitless possibilities that lie before you. Imagine the vibrant hues of a hummingbird feather dancing on your ankle, a whisper of the unbridled joy of untamed spirit.\r\n\r\n<strong>Transformation:<\/strong> Just as butterflies emerge from cocoons, feathers symbolize metamorphosis and personal growth. They represent shedding old burdens and embracing new beginnings, whether it’s overcoming obstacles, stepping into a new chapter, or leaving behind outdated versions of yourself. Picture a delicate finch feather in watercolor, its soft hues capturing the grace and resilience inherent in the journey of transformation.\r\n\r\n<strong>Connection to the Sky:<\/strong> In many cultures, feathers act as celestial bridges, carrying prayers on the wind and connecting us to our ancestors and the divine. A dreamcatcher woven with intricate feathers, adorned with tiny turquoise beads, can symbolize the protection and guidance offered by the spirit world. A single phoenix feather rising from the ashes on your back can be a beacon of hope, signifying rebirth and the enduring power of the human spirit.\r\n\r\n<strong>Resilience and Strength:<\/strong> Not all feathers belong to graceful creatures. Eagles, owls, and ravens possess feathers that speak of power, tenacity, and unwavering spirit. A bold, black raven feather tattoo adorning your bicep can be a testament to your inner strength, a reminder of your ability to overcome challenges and rise above adversity.\r\n\r\n<strong>Individuality:<\/strong> No two feathers are alike. Each boasts a unique pattern, texture, and color, reflecting the individuality of the creature it belongs to. A peacock feather tattoo, its kaleidoscope of colors and iridescent sheen, can be a celebration of your unique quirks and the confidence to stand out from the crowd.\r\n\r\n<strong>Spiritual Meaning:<\/strong> In many spiritual traditions, feathers symbolize the breath of life, connecting us to the divine and the interconnectedness of all things. A single eagle feather, its white tips reaching towards the heavens, can represent ascension and the pursuit of spiritual enlightenment.\r\n<h3>Beyond the Meaning: Crafting Your Masterpiece in Ink<\/h3>\r\nWith such a wealth of meaning at your fingertips, choosing the right feather design can feel like navigating a starlit sky. But fear not, aspiring ink-bearer! Here’s your guide to crafting your feather masterpiece:\r\n\r\n<strong>Realistic vs. Stylized:<\/strong> Do you crave a lifelike depiction of an eagle feather, its every barb and quill meticulously rendered? Or are you drawn to the whimsical charm of a hummingbird feather, its delicate form captured in watercolor? Choose a style that resonates with your personality and aesthetic.\r\n\r\n<strong>Single Plume or Flock Formation:<\/strong> A lone feather can speak volumes about solitude and introspection, while a flock taking flight can evoke themes of community, shared journeys, and the power of collective spirit. Consider the message you want to convey and choose a design that amplifies it.\r\n\r\n<strong>Placement Matters:<\/strong> Biceps scream strength, ankles whisper freedom, and necks dance with grace. Choose a location that complements your feather’s meaning and flatters your body. Consider a feather tattoo behind the ear for a touch of mystical intrigue, or a feather cascading down your arm for a dramatic statement.\r\n\r\n<strong>Small vs. Bold:<\/strong> While small feather tattoos offer a touch of understated elegance, bolder designs allow for more intricate details and symbolism. Consider the impact you want to make and choose a size that resonates with your personality and style.\r\n\r\n<strong>Colorful vs. Black and Grey:<\/strong> Unleash the vibrant hues of nature with a colorful feather tattoo, or embrace the stark beauty of black and grey lines for a minimalist approach. Consider the emotions you want to evoke and choose a color palette that resonates with your message.\r\n\r\n<strong>Trends and Styles:<\/strong> Fine line feather tattoos offer delicate precision, while geometric designs bring a modern twist. Tribal feather tattoos connect you to ancient traditions, while watercolor styles capture the ethereal beauty of feathers.\r\n<h3>Exploring the Symphony of Feathers: Delving into Specific Designs<\/h3>\r\nEach feather carries its own unique story, whispering secrets through its shape, color, and symbolism. Let’s delve deeper into some of the most popular feather designs and unlock the hidden messages they hold:\r\n\r\n<strong>Eagle Feather Tattoo Meaning:<\/strong> Renowned for their strength, vision, and leadership, eagles symbolize courage, freedom, and spiritual guidance. An eagle feather tattoo, with its majestic sweep and sharp quills, can be a powerful reminder to soar above challenges and embrace your inner leader.\r\n\r\n<strong>Owl Feather Tattoo Meaning:<\/strong> Associated with wisdom, intuition, and protection, owl feathers offer insight, guidance through darkness, and a connection to the unseen realms. An owl feather tattoo, with its watchful eyes and silent flight, can be a talisman of wisdom and a reminder to trust your intuition.\r\n\r\n<strong>Phoenix Feather Tattoo Meaning:<\/strong> The mythical phoenix, rising from ashes, embodies rebirth, transformation, and the unwavering spirit of renewal. A phoenix feather tattoo, with its fiery hues and elegant curves, can be a symbol of overcoming adversity and emerging stronger from challenges.\r\n\r\n<strong>Hummingbird Feather Tattoo Meaning:<\/strong> Tiny yet tenacious, hummingbirds symbolize joy, resilience, and the ability to find sweetness even amidst life’s storms. A hummingbird feather tattoo, with its delicate strokes and vibrant colors, can be a reminder to savor life’s simple pleasures and face challenges with grace.\r\n\r\n<strong>Peacock Feather Tattoo Meaning:<\/strong> With its dazzling display of colors and iridescent sheen, the peacock feather represents beauty, abundance, and spiritual awakening. A peacock feather tattoo can be a celebration of your unique self and a reminder to embrace your inner radiance.\r\n\r\n<strong>Raven Feather Tattoo Meaning:<\/strong> Often associated with mystery, prophecy, and transformation, the raven feather can symbolize introspection, wisdom gained through darkness, and the power of facing your shadow. A raven feather tattoo, with its black depths and sharp edges, can be a reminder to embrace your complexities and find wisdom in the shadows.\r\n\r\n<strong>Dreamcatcher Feather Tattoos:<\/strong> Woven with intricate feathers and adorned with beads, dreamcatchers filter negative dreams and attract positive ones. A dreamcatcher feather tattoo, often featuring eagle or owl feathers, can be a symbol of protection, guidance, and the power of positive dreams.\r\n<h3>Trends and Styles: A Canvas of Ink and Imagination<\/h3>\r\nThe world of feather tattoos is a vibrant tapestry woven with diverse styles and artistic expressions. Let’s explore some of the hottest trends and discover how they can transform your feather design:\r\n\r\n<strong>Fine Line Feather Tattoos:<\/strong> Delicate and minimalist, fine line feather tattoos offer a subtle yet sophisticated way to wear your ink. They’re perfect for those who prefer understated elegance and appreciate the intricate beauty of a single line.\r\n\r\n<strong>Black and Grey Feather Tattoos:<\/strong> Bold and dramatic, black and grey feather tattoos exude a timeless elegance. They allow for intricate shading and realistic details, making them ideal for capturing the raw power and intricate patterns of feathers.\r\n\r\n<strong>Geometric Feather Tattoos:<\/strong> Modern and eye-catching, geometric feather tattoos bring a contemporary twist to this classic motif. They utilize sharp lines, bold shapes, and unexpected angles to create a unique and visually striking design.\r\n\r\n<strong>Tribal Feather Tattoos:<\/strong> Rooted in ancient traditions, tribal feather tattoos connect you to the wisdom and symbolism of indigenous cultures. They often feature bold lines, intricate patterns, and symbolic elements that represent strength, community, and spiritual connection.\r\n\r\n<strong>Single Feather Tattoos:<\/strong> Simple yet impactful, single feather tattoos offer a powerful statement of meaning and individuality. They can be placed discreetly or boldly, making them versatile for those seeking a minimalist or dramatic approach.\r\n\r\n<strong>Flying Feather Tattoos:<\/strong> Capturing the essence of flight and freedom, flying feather tattoos are dynamic and eye-catching. They depict feathers in motion, adding a sense of movement and energy to your design.\r\n\r\n<strong>Feather Tattoos for Women:<\/strong> From delicate watercolor designs to bold geometric patterns, feather tattoos offer endless possibilities for women. Consider designs that complement your body shape, personality, and individual style.\r\n\r\n<strong>Feather Tattoos for Men:<\/strong> Whether you prefer the fierce power of an eagle feather or the mystical allure of a raven feather, there’s a feather design that speaks to your inner strength and masculinity. Explore bold black and grey designs, geometric patterns, or tribal motifs to create a unique and impactful tattoo.\r\n<h3>Beyond the Ink: A Journey of Transformation<\/h3>\r\nFeather tattoos are more than just beautiful markings on your skin; they are living testaments to your journey, whispers of your inner strength, and reminders of your values. Choosing the right design is just the first step. Here’s how to ensure your feathered friend truly takes flight:\r\n\r\n<strong>Find Your Ink Master:<\/strong> Research tattoo artists who specialize in feather designs. Look for portfolios that resonate with your chosen style, and prioritize artists who value collaboration and listening to your vision. Remember, a skilled artist can transform your idea into a masterpiece that sings your story.\r\n\r\n<strong>Embrace the Dialogue:<\/strong> Don’t be shy about sharing your ideas, inspirations, and personal connections to feathers. A collaborative discussion with your artist can elevate your design from good to unforgettable. Think of it as a co-creation, where your vision meets their expertise to create a piece that truly embodies you.\r\n\r\n<strong>Aftercare is Key:<\/strong> Treat your new artwork with the respect it deserves. Follow the aftercare instructions meticulously to ensure proper healing and prevent complications. Remember, good aftercare is crucial for maintaining the vibrancy and longevity of your feathered masterpiece.\r\n\r\n<strong>Let Your Feathers Speak:<\/strong> Don’t be afraid to share your story with the world. Your feather tattoo is a conversation starter, a gateway to connecting with others who resonate with its meaning. Embrace the compliments, answer questions with pride, and let your ink speak volumes about the person you are and the journey you’ve taken.\r\n<h3>Unveiling the Global Tapestry: Feather Tattoos Across Cultures<\/h3>\r\nThe beauty of feathers transcends borders and cultures. Their symbolism, though diverse, often converges on themes of transformation, freedom, and connection to the divine. Let’s embark on a global journey, exploring how different cultures interpret these magnificent plumes:\r\n\r\n<strong>Native American Traditions:<\/strong> In many Native American cultures, feathers represent the breath of life, connecting us to the spirit world and our ancestors. Eagle feathers symbolize strength and leadership, while owl feathers embody wisdom and protection.\r\n\r\n<strong>Celtic Mythology:<\/strong> In Celtic lore, feathers are associated with the goddess Brigid, representing creativity, healing, and transformation. Raven feathers symbolize prophecy and wisdom gained through introspection, while heron feathers signify patience and the ability to navigate life’s challenges.\r\n\r\n<strong>Hinduism and Buddhism:<\/strong> In these Eastern traditions, feathers are often associated with Garuda, the mythical bird-like deity. Peacock feathers symbolize pride, prosperity, and spiritual awakening, while swan feathers represent purity, grace, and inner peace.\r\n\r\n<strong>Egyptian Culture:<\/strong> In ancient Egypt, feathers held immense significance. Maat, the goddess of truth and justice, is often depicted wearing an ostrich feather headdress, symbolizing balance and cosmic order. Hawk feathers, associated with the god Horus, represent the sun and protection.\r\n\r\n<strong>African Tribal Art:<\/strong> In many African cultures, feathers are associated with ancestors and spirits. They adorn ceremonial attire and sacred objects, serving as conduits for communication with the divine. Ostrich feathers symbolize fertility and abundance, while parrot feathers represent joy, communication, and the vibrancy of life.\r\n<h3>A Celebration of Creativity: Beyond the Traditional<\/h3>\r\nWhile ancient traditions offer a wealth of meaning, the world of feather tattoos is constantly evolving. Modern artists and ink-enthusiasts are pushing boundaries, reinterpreting symbolism, and creating stunningly unique designs:\r\n\r\n<strong>Geometric Feathers:<\/strong> Blending clean lines and sharp angles, geometric feather tattoos offer a modern take on classic symbolism. They can represent structure, resilience, and the interconnectedness of all things.\r\n\r\n<strong>Abstract Expressions:<\/strong> Feather tattoos can transcend literal interpretations, embracing abstract forms and vibrant colors. These designs invite personal reflection and encourage individual interpretations of their meaning.\r\n\r\n<strong>Minimalist Elegance:<\/strong> For those seeking understated beauty, minimalist feather tattoos offer a delicate touch. Fine lines and subtle shading capture the essence of a feather without overwhelming the canvas.\r\n\r\n<strong>Pop Culture Influences:<\/strong> From mythical creatures like phoenixes to fantastical birds from video games and anime, pop culture is finding its way into feather tattoo designs. These tattoos allow individuals to express their passions and connect with like-minded communities.\r\n<h3>A Legacy in Ink: Preserving the Stories Feathers Tell<\/h3>\r\nFeather tattoos are more than just ink on skin; they are living stories, evolving with the wearer. They mark milestones, celebrate victories, and offer solace in times of struggle. As your life unfolds, your feather tattoo may take on new meanings, becoming a cherished companion on your journey.\r\n\r\nSo, embrace the beauty and symbolism of feathers. Let them guide you on a path of self-discovery, inspire your creativity, and connect you to something larger than yourself. Remember, your ink is your story, and your feather tattoo is a testament to the unique and powerful flight you take through life.\r\n<h3>The Final Flight: A Call to Action<\/h3>\r\nThis comprehensive guide is just the beginning of your feather tattoo journey. Share your stories, inspire others, and keep the conversation going. Here are some ways to get involved:\r\n<ul>\r\n \t<li>Share your own feather tattoo designs and meanings in the comments below.<\/li>\r\n \t<li>Recommend this article to friends and family who might be interested in feather tattoos.<\/li>\r\n \t<li>Create your own artwork or write stories inspired by feathers and share them online.<\/li>\r\n \t<li>Tag us on social media with your feather tattoos and let us celebrate your unique expression.<\/li>\r\n<\/ul>\r\nTogether, we can continue to explore the boundless beauty and symbolism of feathers, enriching the world with stories etched in ink and the spirit of flight taking wing.\r\n\r\n<strong>Are you ready to take flight?<\/strong> Your feather tattoo awaits, a canvas to paint your story and a companion to guide you on your journey. But before you dive headfirst into the world of ink, consider these final thoughts:\r\n\r\n<strong>Listen to Your Inner Compass:<\/strong> Don’t choose a design based on trends or what looks good on others. Let your intuition guide you towards a feather that resonates with your soul, a symbol that whispers to your inner landscape.\r\n\r\n<strong>Embrace the Journey:<\/strong> Choosing a tattoo is a personal odyssey, a time for introspection and self-discovery. Enjoy the research, the discussions with artists, and the anticipation of seeing your vision come to life.\r\n\r\n<strong>Respect the Artform:<\/strong> Remember, tattooing is a sacred art form, not a fleeting impulse. Choose a reputable artist, follow aftercare instructions diligently, and treat your tattoo with the respect it deserves.\r\n\r\n<strong>Let Your Feathers Fly:<\/strong> Your ink is a conversation starter, a bridge to connect with like-minded souls. Wear your feather tattoo with pride, share its story with the world, and inspire others to embrace their own unique journeys.\r\n\r\n<strong>Remember, the sky’s the limit when it comes to feather tattoos. So, spread your wings, take flight, and let your ink tell the world the story of your soul.<\/strong>\r\n\r\nFurther Exploration:\r\n\r\nFor a deeper dive into specific feather meanings and cultural interpretations, explore these resources:\r\n<ul>\r\n \t<li>“The Feather Dictionary: Symbolic Meanings of Feathers” by Pamela Hillard<\/li>\r\n \t<li>“Feather Symbolism: A Guide to the Spiritual Meaning of Bird Feathers” by Ted Andrews<\/li>\r\n \t<li>“The Complete Book of Feathers: When Birds Speak to You” by Ted Andrews<\/li>\r\n<\/ul>\r\nConnect with the global community of feather tattoo enthusiasts:\r\n<ul>\r\n \t<li><strong>Instagram hashtags:<\/strong> #feathertattoo, #featherart, #birdfeathers, #tattooinspiration<\/li>\r\n \t<li><strong>Online forums and communities:<\/strong> Reddit’s r\/tattoos, Skin Deep, Tattoo Artists Collective<\/li>\r\n<\/ul>\r\nDiscover the diverse styles and techniques of feather tattoo artists:\r\n<ul>\r\n \t<li><strong>Pinterest boards:<\/strong> Feather Tattoos, Unique Feather Designs, Watercolor Feather Tattoos<\/li>\r\n \t<li><strong>Tattoo artist websites and social media profiles<\/strong><\/li>\r\n<\/ul>\r\nThis concludes our comprehensive guide to feather tattoos. May your journey be filled with creativity, inspiration, and the unwavering spirit of flight.\r\n\r\nThank you for joining us on this odyssey into the mesmerizing world of feather tattoos. We hope this guide has inspired you to embrace your unique story and take wing with the power of ink.\r\n\r\nRemember, the sky’s the limit when it comes to feather tattoos. So, spread your wings, take flight, and let your ink tell the world the story of your soul.\r\n<h3>We wish you all the best on your inky journey!<\/h3>\r\n<strong>Please Note:<\/strong> This guide is intended for informational purposes only and should not be substituted for professional advice from a qualified tattoo artist. Always do your research, choose a reputable artist, and prioritize your health and safety throughout the tattooing process.","link":"https:\/\/blackpoisontattoos.com\/portfolio_category\/feathers-tattoos\/","name":"Feather Tattoos","slug":"feathers-tattoos","taxonomy":"portfolio_category","parent":0,"meta":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v22.1 (Yoast SEO v22.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The Ultimate Guide to Feather Tattoos &amp; Their Meaning<\/title>\n<meta name=\"description\" content=\"Soar through the symbolism and beauty of feather tattoos! Discover their diverse meanings, explore stunning designs, and find the perfect ink to tell your story. From eagle feathers to phoenix wings, this guide is your compass to a flight of self-expression.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/blackpoisontattoos.com\/portfolio_category\/feathers-tattoos\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The Ultimate Guide to Feather Tattoos &amp; Their Meaning\" \/>\n<meta property=\"og:description\" content=\"Soar through the symbolism and beauty of feather tattoos! Discover their diverse meanings, explore stunning designs, and find the perfect ink to tell your story. From eagle feathers to phoenix wings, this guide is your compass to a flight of self-expression.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/blackpoisontattoos.com\/portfolio_category\/feathers-tattoos\/\" \/>\n<meta property=\"og:site_name\" content=\"Black Poison Tattoos\" \/>\n<meta property=\"og:image\" content=\"https:\/\/blackpoisontattoos.com\/ind\/wp-content\/uploads\/2023\/06\/BLP-Default-Meta-Image-for-All-Pages-1200px-x-675px.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"675\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"The Ultimate Guide to Feather Tattoos &amp; Their Meaning\" \/>\n<meta name=\"twitter:description\" content=\"Soar through the symbolism and beauty of feather tattoos! Discover their diverse meanings, explore stunning designs, and find the perfect ink to tell your story. From eagle feathers to phoenix wings, this guide is your compass to a flight of self-expression.\" \/>\n<meta name=\"twitter:site\" content=\"@bpoisontattoo\" \/>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"The Ultimate Guide to Feather Tattoos & Their Meaning","description":"Soar through the symbolism and beauty of feather tattoos! Discover their diverse meanings, explore stunning designs, and find the perfect ink to tell your story. From eagle feathers to phoenix wings, this guide is your compass to a flight of self-expression.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/blackpoisontattoos.com\/portfolio_category\/feathers-tattoos\/","og_locale":"en_GB","og_type":"article","og_title":"The Ultimate Guide to Feather Tattoos & Their Meaning","og_description":"Soar through the symbolism and beauty of feather tattoos! Discover their diverse meanings, explore stunning designs, and find the perfect ink to tell your story. From eagle feathers to phoenix wings, this guide is your compass to a flight of self-expression.","og_url":"https:\/\/blackpoisontattoos.com\/portfolio_category\/feathers-tattoos\/","og_site_name":"Black Poison Tattoos","og_image":[{"width":1200,"height":675,"url":"https:\/\/blackpoisontattoos.com\/ind\/wp-content\/uploads\/2023\/06\/BLP-Default-Meta-Image-for-All-Pages-1200px-x-675px.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_title":"The Ultimate Guide to Feather Tattoos & Their Meaning","twitter_description":"Soar through the symbolism and beauty of feather tattoos! Discover their diverse meanings, explore stunning designs, and find the perfect ink to tell your story. From eagle feathers to phoenix wings, this guide is your compass to a flight of self-expression.","twitter_site":"@bpoisontattoo","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"CollectionPage","@id":"https:\/\/blackpoisontattoos.com\/portfolio_category\/feathers-tattoos\/","url":"https:\/\/blackpoisontattoos.com\/portfolio_category\/feathers-tattoos\/","name":"The Ultimate Guide to Feather Tattoos & Their Meaning","isPartOf":{"@id":"https:\/\/blackpoisontattoos.com\/#website"},"description":"Soar through the symbolism and beauty of feather tattoos! Discover their diverse meanings, explore stunning designs, and find the perfect ink to tell your story. From eagle feathers to phoenix wings, this guide is your compass to a flight of self-expression.","breadcrumb":{"@id":"https:\/\/blackpoisontattoos.com\/portfolio_category\/feathers-tattoos\/#breadcrumb"},"inLanguage":"en-GB"},{"@type":"BreadcrumbList","@id":"https:\/\/blackpoisontattoos.com\/portfolio_category\/feathers-tattoos\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/blackpoisontattoos.com\/"},{"@type":"ListItem","position":2,"name":"Feather Tattoos"}]},{"@type":"WebSite","@id":"https:\/\/blackpoisontattoos.com\/#website","url":"https:\/\/blackpoisontattoos.com\/","name":"Black Poison Tattoos","description":"Highly Rated Tattoo Shop of Ahmedabad","publisher":{"@id":"https:\/\/blackpoisontattoos.com\/#organization"},"alternateName":"Black Poison Tattoo Studio","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/blackpoisontattoos.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/blackpoisontattoos.com\/#organization","name":"Black Poison Tattoos","alternateName":"Black Poison Tattoo Studio","url":"https:\/\/blackpoisontattoos.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/blackpoisontattoos.com\/#\/schema\/logo\/image\/","url":"https:\/\/blackpoisontattoos.com\/ind\/wp-content\/uploads\/2023\/04\/Black-Poison-Tattoos-Logo-2023-512.png","contentUrl":"https:\/\/blackpoisontattoos.com\/ind\/wp-content\/uploads\/2023\/04\/Black-Poison-Tattoos-Logo-2023-512.png","width":512,"height":109,"caption":"Black Poison Tattoos"},"image":{"@id":"https:\/\/blackpoisontattoos.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/blackpoisontattoos","https:\/\/twitter.com\/bpoisontattoo","https:\/\/instagram.com\/blackpoisontattoos\/","https:\/\/www.linkedin.com\/company\/black-poison-tattoos","https:\/\/in.pinterest.com\/blackpoisontattoos\/"]}]}},"_links":{"self":[{"href":"https:\/\/blackpoisontattoos.com\/wp-json\/wp\/v2\/portfolio_category\/78"}],"collection":[{"href":"https:\/\/blackpoisontattoos.com\/wp-json\/wp\/v2\/portfolio_category"}],"about":[{"href":"https:\/\/blackpoisontattoos.com\/wp-json\/wp\/v2\/taxonomies\/portfolio_category"}],"wp:post_type":[{"href":"https:\/\/blackpoisontattoos.com\/wp-json\/wp\/v2\/portfolio?portfolio_category=78"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}